{"url_to_unified_index": {"https://mn.gov/dhs/opip/opioid-guidelines/tapering-opioids/": 4, "https://effectivehealthcare.ahrq.gov/products/nonopioid-chronic-pain/protocol": 1, "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9194670/": 5, "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6129223/": 6, "https://www.addictioncenter.com/opiates/oxycodone/": 3, "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4018705/": 2, "https://stanfordhealthcare.org/medical-conditions/pain/pain/treatments/non-pharmacological-pain-management.html": 7, "https://www.cdc.gov/mmwr/volumes/71/rr/rr7103a1.htm": 8, "https://www.ncbi.nlm.nih.gov/books/NBK458655/": 9, "https://www.cdc.gov/overdose-prevention/manage-treat-pain/nonopioid-therapies.html": 21, "https://nam.edu/best-practices-research-gaps-and-future-priorities-to-support-tapering-patients-on-long-term-opioid-therapy-for-chronic-non-cancer-pain-in-outpatient-settings/": 15, "https://www.nps.org.au/news/5-steps-to-tapering-opioids": 17, "https://www.cdc.gov/drugoverdose/training/dosing/accessible/index.html": 20, "https://www.hss.edu/conditions_patient-guide-opioid-tapering.asp": 18, "https://www.cdc.gov/overdose-prevention/hcp/clinical-care/nonopioid-therapies-for-pain-management.html": 19, "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7384622/": 13, "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5843113/": 14, "https://www.ncbi.nlm.nih.gov/books/NBK572296/": 24, "https://www.fda.gov/drugs/drug-safety-and-availability/fda-identifies-harm-reported-sudden-discontinuation-opioid-pain-medicines-and-requires-label-changes": 23, "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC315480/": 22, "https://www.aafp.org/pubs/afp/issues/2020/0101/p49.html": 26, "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6349552/": 25, "https://www.nps.org.au/professionals/opioid-tapering-algorithm-text-version": 12, "https://www.health.harvard.edu/blog/undoing-the-harm-tapering-down-from-high-dose-opioids-2019051016622": 10, "https://www.therecoveryvillage.com/oxycodone-addiction/oxycodone-taper/": 11, "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8335575/": 16}, "url_to_info": {"https://mn.gov/dhs/opip/opioid-guidelines/tapering-opioids/": {"url": "https://mn.gov/dhs/opip/opioid-guidelines/tapering-opioids/", "description": "The taper may reveal underlying ... by opioid therapy, or the taper itself may illicit depression and anxiety which needs to be addressed. Research examining the use of behavioral health care during a taper suggest that integrating therapies before and during a taper can help manage pain and improve the likelihood of tapering success. (Frank, 2017) Access to behavioral health therapy is a challenge, especially ...", "snippets": ["A detailed process for tapering and discontinuing opioid use in situations with chronic opioid analgesic treatment (COAT)", "Effort must be made to ensure the patient can self-report problems with the taper and other issues without fear of judgment, and providers must be willing to halt or discontinue the taper depending on the patient’s circumstances. Continually provide patients reassurance and convey your confidence in their ability to achieve their goals. Make yourself or a team member available to the patient to provide support, if needed (VA Opioid Decision Taper Tool, 2019).", "The taper may reveal underlying mental health conditions that were previously masked by opioid therapy, or the taper itself may illicit depression and anxiety which needs to be addressed. Research examining the use of behavioral health care during a taper suggest that integrating therapies before and during a taper can help manage pain and improve the likelihood of tapering success. (Frank, 2017) Access to behavioral health therapy is a challenge, especially in rural areas.", "In order to determine whether a taper is indicated, providers must complete and document a thorough, thoughtful risk benefit analysis (RBA) of continuing opioid therapy at the current dose. A thorough RBA requires a depth of knowledge about the patient’s circumstances, which is why tapers should occur within a strong, therapeutic alliance.", "A taper is a reduction in daily opioid dosage done to improve a patient’s safety profile or quality of life. A successful taper reflects shared decision making and can result in either a lower daily dose, or discontinuation of opioid therapy, dependent on the patient’s goals and risk profile."], "title": "Tapering and discontinuing opioid use / Minnesota Opioid Guidelines"}, "https://effectivehealthcare.ahrq.gov/products/nonopioid-chronic-pain/protocol": {"url": "https://effectivehealthcare.ahrq.gov/products/nonopioid-chronic-pain/protocol", "description": "I. Background and Objectives for the Systematic Review Understanding Chronic Pain Chronic pain is typically defined as pain lasting at least 3 to 6 months or that which persists past the time for normal tissue healing.1 From a strictly biological perspective, pain is activation of the sensory ...", "snippets": ["I. Background and Objectives for the Systematic Review Understanding Chronic Pain Chronic pain is typically defined as pain lasting at least 3 to 6 months or that which persists past the time for normal tissue healing.1 From a strictly biological perspective, pain is activation of the sensory nervous system's nociceptive and hypothalamic-pituitary-adrenal axis.2 Adding to the complexity of chronic pain are its diverse origins and the subjective experience of a sufferer.", "Factors that may affect applicability which we have identified a priori include eligibility criteria and patient factors (e.g., demographic characteristics, duration or severity of pain, underlying pain condition, presence of medical and psychiatric comorbidities, event rates and symptom severity in treatment and control groups), intervention factors (e.g., dose and duration of therapy, intensity and frequency of monitoring, level of adherence support, use of co-interventions), comparisons (e.g., type of comparator, effectiveness and feasibility of active comparators), outcomes (e.g., use of unvalidated or nonstandardized outcomes, measurement of short-term or surrogate outcomes), settings (e.g., primary care vs."], "title": "Nonopioid Pharmacologic Treatments for Chronic Pain | Effective Health Care (EHC) Program"}, "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9194670/": {"url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9194670/", "description": "These findings suggest that opioid tapering was associated with increased rates of overdose, withdrawal, and mental health crisis extending up to 2 years after taper initiation. Over the past 2 decades, millions of Americans have been prescribed opioids to manage chronic pain.", "snippets": ["These findings suggest that opioid tapering was associated with increased rates of overdose, withdrawal, and mental health crisis extending up to 2 years after taper initiation. Over the past 2 decades, millions of Americans have been prescribed opioids to manage chronic pain. Although supported by limited evidence, medical educators encouraged the practice of initiating and escalating opioid dosages to address uncontrolled chronic pain, and drug companies aggressively marketed opioids, leading to increases in opioid prescriptions and the number of patients prescribed long-term opioid therapy (LTOT).1 As opioid overdose deaths subsequently increased, state and regional policies have encouraged opioid deprescribing and dose reduction, or tapering, among patients prescribed LTOT.", "According to a US Department of Health and Human Services (HHS) guideline,3 dose tapering in patients prescribed LTOT should be considered when the risks of dose continuation outweigh the benefits in terms of pain relief and functional improvement. A dose-response association has been observed between long-term opioids and overdose risk,4,5 prompting the CDC to caution clinicians about escalating daily opioid doses greater than 50 morphine milligram equivalents (MME).6 On the other hand, opioid tapering may also confer patient risks, including precipitated withdrawal, worsening pain, use of illicit opioids, depression, anxiety, and suicide.7,8,9,10 Research documenting risks associated with tapering, however, has generally examined periods near the time of initial dose reduction or discontinuation.", "Patients prescribed long-term opioid therapy are increasingly undergoing dose tapering. Recent studies suggest that tapering is associated with short-term risks of substance misuse, overdose, and mental health crisis, although lower opioid dose could reduce risks of adverse events over the longer term.", "It is conceivable that opioid dose reduction in patients prescribed LTOT may reduce patient risks of adverse events with longer-term follow-up. We recently reported that opioid dose tapering was associated with higher rates of overdose and mental health crisis during a 1-year follow-up period in a cohort of patients prescribed stable doses of LTOT.11 In the current study, we used an exposure-crossover design to examine longer-term risks of these adverse events among patients who initiated tapers in the cohort.12,13 In an exposure-crossover study, patients serve as their own controls, and event rates are compared before and after patients transition from the unexposed to the exposed state (from pretaper to posttaper)."], "title": "Long-term Risk of Overdose or Mental Health Crisis After Opioid Dose Tapering - PMC"}, "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6129223/": {"url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6129223/", "description": "In response to the opioid epidemic and new guidelines, many patients on high-dose long term opioid therapy (LTOT) for chronic pain are getting tapered off opioids. As a result, a unique clinical challenge is emerging: while many on LTOT have poor pain ...", "snippets": ["Opioid tapering, a seemingly logical intervention in this situation, may lead to worsening of pain, function and psychiatric symptoms due to development of protracted abstinence syndrome. We offer practicing clinicians management principles and practical guidance focused on management of CPD in addition to chronic pain in these difficult clinical scenarios.", "Dependence (not necessarily addiction), when well established, interacts bidirectionally and dynamically with pain, other symptoms, stress, sleep and psychological distress causing significant lability of all these, driving up the perceived need for opioids and other medications, especially psychoactive ones, to control various symptoms."], "title": "The conundrum of opioid tapering in long-term opioid therapy for chronic pain: A commentary - PMC"}, "https://www.addictioncenter.com/opiates/oxycodone/": {"url": "https://www.addictioncenter.com/opiates/oxycodone/", "description": "Not only is it an expensive and debilitating addiction, overdose from oxycodone is a very real — and potentially deadly — possibility. People who are suffering from an oxycodone use disorder usually require a medically managed detox and a good treatment program to prevent relapse.", "snippets": ["Oxycodone is used in many painkillers. Oxycodone addiction comes with many dangers and side effects, some of which are detailed here.", "Many people who abuse oxycodone start out by taking a prescribed amount — but as their body develops a tolerance to the drug, they need a higher dose to maintain the same relief or high. The transition from use to abuse to addiction can be quick and dangerous."], "title": "Oxycodone Addiction And Abuse - A Potent Painkiller"}, "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4018705/": {"url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4018705/", "description": "Oxycodone is widely used to alleviate moderate-to severe acute pain, It is an effective analgesic for many types of pain, and is especially useful for paroxysmal spontaneous pain, steady pain, allodynia associated with postherpetic neuralgia, and it is ...", "snippets": ["In 2011, following chemical and physical manipulation, an extended-release form of oxycodone was developed in order to maintain its rate-controlling mechanism. This new formulation significantly improved analgesia among patients with moderate-to-severe chronic osteoarthritis pain with an adverse event profile similar to that of other opioids.", "Oxycodone is an analgesic opioid medication that is generally used for the relief of moderate-to-severe pain. It was first developed by German researchers in 1916 from opium-derived thebaine (1). Oxycontin was approved by the FDA in 1995, and was introduced into the United States market in 1996 (2).", "Oxycodone is metabolized by the cytochrome p450 enzyme system in the liver. Only 10% is excreted unchanged in urine (4, 5). Because it is metabolized by CYP3A4 and CYP2D6 enzymes, oxycodone is prone to pharmacokinetic drug interactions (6)."], "title": "Use of Oxycodone in Pain Management - PMC"}, "https://stanfordhealthcare.org/medical-conditions/pain/pain/treatments/non-pharmacological-pain-management.html": {"url": "https://stanfordhealthcare.org/medical-conditions/pain/pain/treatments/non-pharmacological-pain-management.html", "description": "Learn more about non-pharmacological pain management, with strategies like neurostimulation, hypnosis, comfort therapy, and physical therapy.", "snippets": ["Examples of these non-pharmacological pain management techniques include the following:", "This method utilizes ways to alter thoughts and focus concentration to better manage and reduce pain. Methods of non-pharmacological pain include:", "Other non-pharmacological pain management may utilize alternative therapies such as comfort therapy, physical and occupational therapy, psychosocial therapy/counseling, and neurostimulation to better manage and reduce pain."], "title": "Management of Pain without Medications | Stanford Health Care"}, "https://www.cdc.gov/mmwr/volumes/71/rr/rr7103a1.htm": {"url": "https://www.cdc.gov/mmwr/volumes/71/rr/rr7103a1.htm", "description": "This report describes CDC’s updated clinical practice guideline for prescribing opioids for pain.", "snippets": ["A multimodal and multidisciplinary approach to pain management attending to the physical health, behavioral health, long-term services and supports, and expected health outcomes and well-being of each person is critical.", "When diagnosis and severity of acute pain warrant the use of opioids, clinicians should prescribe immediate-release opioids (see Recommendation 3) at the lowest effective dose (see Recommendation 4) and for no longer than the expected duration of pain severe enough to require opioids (see Recommendation 6) to minimize unintentional initiation of long-term opioid use. Clinicians should maximize use of nonopioid pharmacologic (e.g., NSAIDs, acetaminophen, or both) and nonpharmacologic (e.g., ice, heat, elevation, rest, immobilization, or exercise) therapies as appropriate for the specific condition and continue these therapies as needed after opioids are discontinued.", "Specific effort was made to identify subject matter experts with knowledge and experience in topics such as chronic and acute pain management, clinical practice, health equity, mental health and well-being, opioids and opioid therapies, opioid tapering, opioid use disorder treatment, pharmacologic and nonpharmacologic pain management, and surgical pain management.", "Clinicians should recommend appropriate noninvasive nonpharmacologic approaches to help manage chronic pain, such as exercise (e.g., aerobic, aquatic, or resistance exercises) or exercise therapy (a prominent modality in physical therapy) for back pain, fibromyalgia, and hip or knee osteoarthritis; weight loss for knee osteoarthritis; manual therapies for hip osteoarthritis; psychological therapy, spinal manipulation, low-level laser therapy, massage, mindfulness-based stress reduction, yoga, acupuncture, and multidisciplinary rehabilitation for low back pain; mind-body practices (e.g., yoga, tai chi, or qigong), massage, and acupuncture for neck pain; cognitive behavioral therapy, myofascial release massage, mindfulness practices, tai chi, qigong, acupuncture, and multidisciplinary rehabilitation for fibromyalgia; and spinal manipulation for tension headache."], "title": "CDC Clinical Practice Guideline for Prescribing Opioids for Pain — United States, 2022 | MMWR"}, "https://www.ncbi.nlm.nih.gov/books/NBK458655/": {"url": "https://www.ncbi.nlm.nih.gov/books/NBK458655/", "description": "This chapter addresses the scope of the problem of pain in the United States and its association with opioids, and the effectiveness of pharmacologic (both opioid and nonopioid) and nonpharmacologic treatments that may, alone or in combination, help individuals manage pain.", "snippets": ["The first section summarizes the scope of the problem of pain, focusing in particular on chronic, or persistent, pain, the form most associated with problematic use of opioids. The chapter then presents a detailed discussion of the various pain treatment modalities, reviewing in turn opioid analgesics, nonopioid pharmacologic treatments, interventional pain therapies, and nonpharmacologic treatments."], "title": "Pain Management and the Intersection of Pain and Opioid Use Disorder - Pain Management and the Opioid Epidemic - NCBI Bookshelf"}, "https://www.cdc.gov/overdose-prevention/manage-treat-pain/nonopioid-therapies.html": {"url": "https://www.cdc.gov/overdose-prevention/manage-treat-pain/nonopioid-therapies.html", "description": "Learn about nonopioid options to manage pain that may work better with fewer risks and side effects.", "snippets": ["Other options, including therapies that don't involve medications, may work just as well or better and have fewer risks and side effects. You can talk to your doctor about ways to manage your pain that do not involve prescription opioids. Patients with pain should receive treatment that provides the greatest benefit relative to risks. Evidence suggests that some nonopioid treatments used for many types of pain, including therapies that don't involve medications, may actually work better for some conditions and have fewer risks and side effects.", "Cognitive behavioral therapy (CBT) – a psychological, goal-directed approach in which patients learn how to modify physical, behavioral, and emotional triggers of pain and stress ... Opioids are just one option for treating pain. Other options work just as well or better and have fewer risks and side effects. Working Together With Your Doctor to Manage Your Pain"], "title": "Nonopioid Therapies | Overdose Prevention | CDC"}, "https://nam.edu/best-practices-research-gaps-and-future-priorities-to-support-tapering-patients-on-long-term-opioid-therapy-for-chronic-non-cancer-pain-in-outpatient-settings/": {"url": "https://nam.edu/best-practices-research-gaps-and-future-priorities-to-support-tapering-patients-on-long-term-opioid-therapy-for-chronic-non-cancer-pain-in-outpatient-settings/", "description": "Introduction Ensuring high-quality, respectful, and appropriate management of chronic non-cancer pain (CNCP) in the context of the US opioid crisis is a critical and complex endeavor. At the […]", "snippets": ["Similarly, the goal of the taper may need to change from one of complete elimination of the opioid therapy to one involving a reduction to the lowest effective dose as guided by assessment of patient function, activity goals, and pain levels. Greater use of interdisciplinary teams and psychological support for these patients during the taper should improve the likelihood of a successful taper, although the evidence for use of interdisciplinary teams in the process has not been sufficiently validated by studies.", "Multidisciplinary in-hospital teams improve patient outcomes: A review. Surgical Neurology International 5(7 Suppl):S295–S303. https://doi.org/10.4103/2152-7806.139612. Henry, S. G., D. A. Paterniti, B. Feng, A. M. Iosif, R. L. Kravitz, G. Weinberg, P. Cowan, and S. Verba. 2019. Patients’ experience with opioid tapering: A conceptual model with recommendations for clinicians.", "In addition, efforts such as the coprescription of naloxone can help decrease the risks of a taper . More research is needed on the use of adjunctive medications, managing withdrawal effectively, approaches for coexisting behavioral health disorders, and strategies for safely tapering polypharmacy patients to ensure that protocols being followed are evidence-based and do not cause patients additional physical or psychological harm.", "Addressing behavioral health needs is important in the treatment of patients on chronic opioids and those who require tapering. Patient care should involve collaboration between the mental health provider and the provider who is managing the opioid taper. To facilitate the diagnosis of behavioral health issues in CNCP patients, providers can use several patient- and/or staff – administered assessment tools to screen for behavioral health or SUDs.", "Providers should inform patients that their tolerance can decrease quickly in response to a taper and emphasize the risk of an overdose . In terms of non-pharmacologic pain management interventions, cognitive behavioral therapy (CBT) is effective in durably decreasing chronic pain intensity and improving function, particularly in select groups of patients . While evidence exists specifically for the use of psychological and mindfulness therapies, multidisciplinary rehabilitation, exercise, and acupuncture for chronic pain, testing has been limited to select indications and popula"], "title": "Best Practices, Research Gaps, and Future Priorities to Support Tapering Patients on Long-Term Opioid Therapy for Chronic Non-Cancer Pain in Outpatient Settings - National Academy of Medicine"}, "https://www.nps.org.au/news/5-steps-to-tapering-opioids": {"url": "https://www.nps.org.au/news/5-steps-to-tapering-opioids", "description": "Tapering opioids may not worsen pain, and recent evidence suggests that it improves function and quality of life. Find out more about how to prepare a successful tapering plan for patients using opioids.", "snippets": ["Multidisciplinary pain management addresses the different aspects of chronic pain including the biopsychosocial impact on the individual.18 The efficacy of a coordinated approach has been recognised to reduce pain severity, and improve mood.18 · Of course, there will be cases where multidisciplinary support is not available, leaving GPs to work alone with their patients to implement tapering plans.", "Multidisciplinary pain management addresses the different aspects of chronic pain including the biopsychosocial impact on the individual.18 The efficacy of a coordinated approach has been recognised to reduce pain severity, and improve mood.18 · Of course, there will be cases where multidisciplinary support is not available, leaving GPs to work alone with their patients to implement tapering plans. To increase chances of success, undertake opioid tapering with motivated patients11 and slowly reduce opioid doses with their input.8,11", "an emphasis on non-pharmacological and self-management strategies such as cognitive behavioural therapy (CBT) or mindfulness meditation · multidisciplinary care through interdisciplinary pain programs ... While current Australian guidelines recommend regular follow-up visits during opioid tapering,12 it is important to acknowledge that weekly visits may not be feasible for patients or practices.", "Withdrawal symptoms and their severity vary among patients. For patients on long-term opioid therapy who have developed opioid dependence, extended withdrawal symptoms can last for weeks or months.24  · Consider seeking multidisciplinary advice or support for patients who are having difficulty with tapering.", "To increase chances of success, undertake opioid tapering with motivated patients11 and slowly reduce opioid doses with their input.8,11 · Consider leveraging networks when planning to taper opioids eg, coordinating medication management reviews with a local pharmacist. Encourage patients to try online pain management programs and to explore local community pain support groups.", "Download the NPS MedicineWise resource: Starting a conversation about opioid tapering with your patients  · Effective pain management planning allows the patient to set specific meaningful and realistic goals that emphasise active self-management.1,16 Self-management strategies can include:1,17 · cognitive behavioural therapy (CBT) techniques such as setting realistic goals, pacing activities and challenging unhelpful thoughts"], "title": "5 steps to tapering opioids for patients with chronic non-cancer pain - NPS MedicineWise"}, "https://www.cdc.gov/drugoverdose/training/dosing/accessible/index.html": {"url": "https://www.cdc.gov/drugoverdose/training/dosing/accessible/index.html", "description": "So, when I am in pain, I take ... more oxycodone for the same pain over and over… · [Provider] It is likely that reducing your dosage will ultimately make you feel better. ... The correct answer is yes. This patient is taking 90 MME per day, without optimization of nonopioid methods of managing pain. It is reasonable to maximize nonopioid therapy while offering this patient an opioid taper, carefully ...", "snippets": ["Patients tapering or discontinuing opioid therapy benefit from a multidisciplinary approach to pain management and frequent, at least weekly, follow-up appointments. Psychological support, especially cognitive behavioral therapy (CBT), combined with other nonpharmacological and nonopioid therapies have proven to be successful."], "title": "Module 6: Dosing and Titration of Opioids: How Much, How Long, and How and When to Stop?"}, "https://www.hss.edu/conditions_patient-guide-opioid-tapering.asp": {"url": "https://www.hss.edu/conditions_patient-guide-opioid-tapering.asp", "description": "Opioid therapy helps manage short-term pain caused by surgery. Learn about tapering or gradual reduction, which is a vital part of the healing process.", "snippets": ["Do not substitute alcohol or other substances to help with tapering down. It is vital for patients, caregivers, and physicians to be vigilant about opioid use and the process of tapering off of these medications. This article should not be viewed as medical advice.", "Physicians and patients should work together to develop a treatment plan to manage withdrawal symptoms. Fast tapering is the process of stopping all opioids or reducing opioids quickly over a few days to a week, decreasing the total daily dose by 20% to 25% every few days to minimize withdrawal symptoms.", "Shorter intervals of time or higher percentage decreases of opiod doses will usually cause severe withdrawal symptoms. Most physicians typically recommend close monitoring and/or supervised centers for patients considering a fast tapering program.", "For patients who may require more extensive or high-dose opioid use, or who have a history of opioid use, tapering (gradual reduction) is a vital part of the healing process. Patients who may benefit from tapering off their opioid regimens should do so under the management of a physician.", "Some patients that have been on high-dose opioids may experience generalized tiredness or feel unwell for a few weeks. Patients who have been taking opioids long-term (more than six months) should discuss with their physician their desire to decrease their opioid use. Physicians and patients should work together to develop a treatment plan to manage withdrawal symptoms. Fast tapering is the process of stopping all opioids or reducing opioids quickly over a few days to a week, decreasing the total daily dose by 20% to 25% every few days to minimize withdrawal symptoms.", "Use relaxation techniques, which can include breathing exercises, music therapy, guided imagery, meditation and reading. Keep a positive outlook and surround yourself with people to keep your moo.d positive. Do not substitute alcohol or other substances to help with tapering down.", "Some patients may feel withdrawal symptoms if they taper off of opioids too quickly, depending on their history of opioid use and their pain."], "title": "A Patient’s Guide to Opioid Tapering | HSS"}, "https://www.cdc.gov/overdose-prevention/hcp/clinical-care/nonopioid-therapies-for-pain-management.html": {"url": "https://www.cdc.gov/overdose-prevention/hcp/clinical-care/nonopioid-therapies-for-pain-management.html", "description": "Nonopioid therapies as an alternative to opioids for pain management.", "snippets": ["Exercise, mind-body interventions, and behavioral treatments (including cognitive behavioral therapy and mindfulness practices) can encourage active patient participation in the care plan and help address the effects of pain in the patient's life. Physical activity can provide additional health benefits such as preventing or reducing symptoms of depression.1 ... Several nonopioid pharmacologic therapies can be used for subacute and chronic pain conditions."], "title": "Nonopioid Therapies for Pain Management | Overdose Prevention | CDC"}, "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7384622/": {"url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7384622/", "description": "Collectively, the core research team, information scientist, and local reference panel have expertise in knowledge synthesis, pain management, opioid prescribing and tapering, clinical practice guideline development, interprofessional/collaborative/multidisciplinary practice, knowledge translation, ...", "snippets": ["Nationally applicable guidelines have been developed in the United States and Canada . While both draw from similar bodies of evidence and have a focus on dose limits for new prescribing, the Canadian guidelines made explicit recommendations for tapering, or dose reduction and used the GRADE approach to categorize recommendations as strong (“the recommendation can be adopted as policy in most situations”) or weak (“policymaking will require substantial debate and involvement of various stakeholders”). These guidelines provided a weak recommendation that prescribers consider tapering opioids for people who are on greater than 90 ME per day. These same guidelines however, included a strong recommendation that “patients using opioids and experiencing serious challenges in tapering” should be referred to formal multidisciplinary care (MDC).", "Collectively, the core research team, information scientist, and local reference panel have expertise in knowledge synthesis, pain management, opioid prescribing and tapering, clinical practice guideline development, interprofessional/collaborative/multidisciplinary practice, knowledge translation, and policy advocacy.", "The entire review process, including research question, search strategy, screening, data extraction, and synthesis was subject to iterative review by the core research team and the local reference panel. We consulted 10 experts from the US and Canada, including investigators from recent systematic reviews and research in this area; clinicians who developed and deliver multidisciplinary care programs; health professionals working in multidisciplinary care settings as well as in primary care including physicians, psychologists and pharmacists; and, a patient with lived experience with opioid tapering and multidisciplinary care.", "Concerns about the contribution of prescribed opioids, and particularly high-dose opioids, continue to mount as do initiatives to reduce prescribing. Evidence around opioid tapering, which can be challenging and potentially hazardous, is not well developed. A recent national guideline has recognized this and recommended referral to multidisciplinary care for challenging cases of opioid tapering."], "title": "Multidisciplinary care for opioid dose reduction in patients with chronic non-cancer pain: A systematic realist review - PMC"}, "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5843113/": {"url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5843113/", "description": "Pharmacists are well positioned to approach patients and work within a multidisciplinary team to initiate and monitor an opioid taper and to increase the success of opioid reduction while minimizing adverse events and harm.", "snippets": ["For patients with CNCP using opioids and experiencing serious challenges in tapering, the Guideline recommends a formal multidisciplinary program.2 This may also apply for those on extremely high doses of opioids where alternative methods such as switching to buprenorphine/naloxone for tapering may be preferred.", "Expert opinion on strategies for opioid tapering is provided in the Guideline2 and outlined in Box 1. Consideration of a multidisciplinary and/or team-based approach is associated with success in opioid tapering.6 Linked to the Guidelines is an information sheet for patients, available through the National Pain Centre.7", "The Guideline directs prescribers to collaborate with pharmacists to support opioid tapering. A multidisciplinary or team-based approach is associated with success in tapering."], "title": "Guidance on opioid tapering in the context of chronic pain: Evidence, practical advice and frequently asked questions - PMC"}, "https://www.ncbi.nlm.nih.gov/books/NBK572296/": {"url": "https://www.ncbi.nlm.nih.gov/books/NBK572296/", "description": "This guideline applies to adult patients with urinary tract infection. The objective is to create an evidence-based and cost-effective strategy for management of UTI in adults.", "snippets": ["Classes of non-opioid medications used for chronic pain and their potential benefits and harms are summarized in Table 7. A successful regimen may combine low doses of different types of pain medications to treat different mechanisms of perceived pain simultaneously, increasing medication effectiveness while limiting the risk of toxicity."], "title": "Pain Management - NCBI Bookshelf"}, "https://www.fda.gov/drugs/drug-safety-and-availability/fda-identifies-harm-reported-sudden-discontinuation-opioid-pain-medicines-and-requires-label-changes": {"url": "https://www.fda.gov/drugs/drug-safety-and-availability/fda-identifies-harm-reported-sudden-discontinuation-opioid-pain-medicines-and-requires-label-changes", "description": "FDA identifies harm reported from sudden discontinuation of opioid pain medicines and requires label changes to guide prescribers on gradual, individualized tapering", "snippets": ["Opioids are a class of powerful prescription medicines that are used to manage pain when other treatments and medicines cannot be taken or are not able to provide enough pain relief. They have serious risks, including abuse, addiction, overdose, and death. Examples of common opioids include codeine, fentanyl, hydrocodone, hydromorphone, morphine, oxycodone, and oxymorphone. Health care professionals should not abruptly discontinue opioids in a patient who is physically dependent. When you and your patient have agreed to taper the dose of opioid analgesic, consider a variety of factors, including the dose of the drug, the duration of treatment, the type of pain being treated, and the physical and psychological attributes of the patient."], "title": "FDA identifies harm reported from sudden discontinuation of opioid pain medicines and requires label changes to guide prescribers on gradual, individualized tapering | FDA"}, "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC315480/": {"url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC315480/", "description": "Ben enjoyed 22 years in recovery ... the time of his accident, the emergency room physician successfully managed his initial pain with a combination of bed rest, cyclobenzaprine, and oxycodone....", "snippets": ["Ben enjoyed 22 years in recovery from addiction to alcohol, was gainfully employed, and had an active and stable family life with his wife and 2 children before suffering a back injury in an auto accident 3 years ago that resulted in a moderately severe pain syndrome. At the time of his accident, the emergency room physician successfully managed his initial pain with a combination of bed rest, cyclobenzaprine, and oxycodone.", "The choice of pain medication is based on the World Health Organization's stepladder approach for mild, moderate, and severe pain.9 Step 1, mild pain, can be treated with acetaminophen, nonsteroidal anti-inflammatory drugs (NSAIDs), and cyclooxygenase-2 (COX-2) inhibitors. Step 2, moderate pain, can be treated with the same agents with the addition of a weak opioid such as codeine or hydrocodone. Step 3, severe pain, should be treated with strong opioids such as morphine, oxycodone, hydromorphone, or methadone."], "title": "Successful Pain Management for the Recovering Addicted Patient - PMC"}, "https://www.aafp.org/pubs/afp/issues/2020/0101/p49.html": {"url": "https://www.aafp.org/pubs/afp/issues/2020/0101/p49.html", "description": "The standard recommendation to decrease opioid doses by 5% to 10% of the starting dose every one to two weeks8 is intolerable for many patients using long-term opioid therapy for chronic pain. Many patients need to decrease by less than 5% every month, with even smaller decrements toward the ...", "snippets": ["Begin by telling the patient, “I’ve been thinking a lot about your chronic pain.” This communicates that the benefit of an opioid taper has been carefully considered and that the plan for a taper is not impulsive or retaliatory. It is rather the result of careful deliberation, including medical assessment of risk vs. benefit. Arrange extra time to discuss this delicate topic. Anticipate the patient’s strong emotional reaction. Pledge your support through this difficult process."], "title": "Tapering Long-Term Opioid Therapy | AAFP"}, "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6349552/": {"url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6349552/", "description": "This study used interview and focus ... productive, patient-centered discussions of opioid tapering. Findings will inform further research on tapering and help primary care clinicians to address this important, often challenging topic....", "snippets": ["This study used interview and focus group data to characterize patients’ experiences with opioid tapering and identify communication strategies that are likely to foster productive, patient-centered discussions of opioid tapering. Findings will inform further research on tapering and help primary care clinicians to address this important, often challenging topic.", "Transcripts were qualitatively analyzed to characterize patients’ tapering experiences, build a conceptual model of these experiences, and identify strategies for promoting productive discussions of opioid tapering. Analyses revealed 3 major themes. First, due to dynamic changes in patients’ social relationships, emotional state, and health status, patients’ pain and perceived need for opioids fluctuate daily; this may conflict with recommendations to taper by a certain amount each month."], "title": "Patients’ experience with opioid tapering: A conceptual model with recommendations for clinicians - PMC"}, "https://www.nps.org.au/professionals/opioid-tapering-algorithm-text-version": {"url": "https://www.nps.org.au/professionals/opioid-tapering-algorithm-text-version", "description": "Consider specialist input if the patient is experiencing serious challenges, or if the main problem is opioid dependency rather than pain.  · When a patient is taking opioids, there are several clinical situations where tapering could be considered.", "snippets": ["Consider specialist input if the patient is experiencing serious challenges in tapering. The algorithm ends here for these patients.  · Revisit the patient’s beliefs and concerns about tapering opioids.", "Patients who are tapering opioids may encounter challenges during the taper.", "These may include increased pain, withdrawal symptoms, or previously unrecognized opioid use disorder. If challenges are encountered, pause the taper and re-evaluate the patient’s goals, pain, clinical status, coping mechanisms, and tapering rate.", "This is an accessible text version of the NPS MedicineWise opioid tapering algorithm, 2020"], "title": "Opioid tapering algorithm, a flowchart - NPS MedicineWise"}, "https://www.health.harvard.edu/blog/undoing-the-harm-tapering-down-from-high-dose-opioids-2019051016622": {"url": "https://www.health.harvard.edu/blog/undoing-the-harm-tapering-down-from-high-dose-opioids-2019051016622", "description": "The CDC’s Guideline on Prescribing Opioids for Chronic Pain helps doctors and patients manage treatment at safe levels and avoid dependence. Any plan to taper medication dosage should ...", "snippets": ["The guideline recommends creating personalized plans for tapering, ensuring that it be slow enough to minimize opioid withdrawal, for example a 10% a week or even 10% a month decrease for those who have been on high-dose opioids for years.", "The CDC’s Guideline on Prescribing Opioids for Chronic Pain helps doctors and patients manage treatment at safe levels and avoid dependence. Any plan to taper medication dosage should be personalized to the patient’s needs."], "title": "Undoing the harm: Tapering down from high-dose opioids - Harvard Health"}, "https://www.therecoveryvillage.com/oxycodone-addiction/oxycodone-taper/": {"url": "https://www.therecoveryvillage.com/oxycodone-addiction/oxycodone-taper/", "description": "Learn how to taper off oxycodone, including different tapering methods, side effects of withdrawal and detox medications commonly used.", "snippets": ["It should not be used in place of the advice of your physician or other qualified healthcare providers. ... Tapering off Oxycodone How to Taper off Oxycodone Types of Oxycodone Opioids Tapering Methods Common Oxycodone Withdrawal Symptoms Side Effects of Oxycodone Tapering Oxycodone Withdrawal Timeline Medications Used When Tapering off Opioids Can Tapering Your Oxycodone Intake Reduce Withdrawal Symptoms?", "Reducing the dose by 10% per week if the person has been taking oxycodone for less than a year · Whenever withdrawal symptoms present themselves, this usually indicates that the taper is too quick. Fortunately, this can be managed by pausing or slowing the rate of the taper. Tapering off oxycodone can take months."], "title": "How to Taper off Oxycodone: Methods, Side Effects & Timeline"}, "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8335575/": {"url": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8335575/", "description": "Among the patients who underwent ... (vs 41.9%). Posttapering patient periods were associated with an adjusted incidence rate of 9.3 overdose events per 100 person-years compared with 5.5 events per 100 person-years in nontapered periods (adjusted incidence rate difference, ...", "snippets": ["Among the patients who underwent dose tapering, 54.3% were women (vs 53.2% among those who did not undergo dose tapering), the mean age was 57.7 years (vs 58.3 years), and 38.8% were commercially insured (vs 41.9%). Posttapering patient periods were associated with an adjusted incidence rate of 9.3 overdose events per 100 person-years compared with 5.5 events per 100 person-years in nontapered periods (adjusted incidence rate difference, 3.8 per 100 person-years [95% CI, 3.0-4.6]; aIRR, 1.68 [95% CI, 1.53-1.85]). Tapering was associated with an adjusted incidence rate of 7.6 mental health cris"], "title": "Association of Dose Tapering With Overdose or Mental Health Crisis Among Patients Prescribed Long-term Opioids - PMC"}}}